uprint/app/views/shops/_shoppov.html.erb

              <% if !(t.date_downloaded) %>
                <% s = Student.find(t.student_id) %>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 8]]