uprint/app/views/shops/index.html.erb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 5]]
---
                  <%= link_to shop_path(t.shop_id) do %>
                    <%= Shop.find(t.shop_id).shop_name %>.
                  <% end %>