uprint/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"  ORDER BY "shops"."shop_name" ASC
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."student_id" = $1  ORDER BY "transactions"."id" DESC LIMIT 5  [["student_id", 8]]
---
  def index
    @shops = Shop.order(:shop_name)
    if student_signed_in?
      @transactions = current_student.transactions.last(5)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1  ORDER BY "shops"."id" ASC LIMIT 1  [["id", 8]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."shop_id" = $1  [["shop_id", 8]]
---
  def show
    @transaction = Shop.find(params[:id]).transactions.build

UPDATE "shops" SET "is_available" = $1, "updated_at" = $2 WHERE "shops"."id" = $3  [["is_available", "f"], ["updated_at", "2016-04-27 18:54:21.178789"], ["id", 4]]
---
  def toggle_availability
    current_shop.update(is_available: !(current_shop.is_available))

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1  ORDER BY "shops"."id" ASC LIMIT 1  [["id", 4]]
---
    def set_shop
      @shop = Shop.find(params[:id])