uprint/app/controllers/transactions_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1  ORDER BY "students"."id" ASC LIMIT 1  [["id", 8]]
INSERT INTO "transactions" ("paper_size", "color_settings", "additional_specs", "date_sent", "price", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	@shop = Shop.find(params[:id])
  	@student = Student.find(params[:id])
  	@transaction = @shop.transactions.create(transaction_params)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."shop_id" = $1 AND "transactions"."id" = $2 LIMIT 1  [["shop_id", 4], ["id", 11]]
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 11]]
---
  def destroy
  	@shop = Shop.find(params[:id])
  	@transaction = @shop.transaction.find(params[:id])
  	@transaction.destroy